emacs.d/config.org
#+Title: config.org

#+OPTIONS: TOC:nil
#+STARTUP: overview

* Emacs Configuration

This is my personal Emacs configuration. I use the [[https://github.com/railwaycat/homebrew-emacsmacport][Railwaycat Emacs for Mac]] port. It has two main advantages over the Emacs for Mac OSX port for me: 1. it renders colors in my Powerline better, and 2. It lets me use 2 finger swiping to navigate through buffers, which is very handy when I am looking at Emacs while working on something else.

*** Screenshot of my config
[[https://github.com/apierz/dotfiles/blob/master/Screen%20Shot%202016-07-03%20at%201.05.39%20PM.png?raw=true]] 

* Personal Information

#+BEGIN_SRC emacs-lisp
  (setq user-full-name "Andy Pierz"
        user-mail-address "andy@andypierz.com")

#+END_SRC
* Packages and Paths

The first thing that gets loaded is =package=, Emacs' package manager. I then add some common repositories for Emacs packages and initialize package.

#+BEGIN_SRC emacs-lisp
  (require 'package)
  (add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/"))
  (add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/"))
  (add-to-list 'package-archives '("melpa-stable" .
  "http://stable.melpa.org/packages/"))

  (setq package-enable-at-startup nil)
  (package-initialize)
#+END_SRC

Next I want to set my load paths, it's mostly the standard folders, plus one for my working Dracula Theme Directory.

#+BEGIN_SRC emacs-lisp
  (add-to-list 'load-path (expand-file-name "snippets" user-emacs-directory))
  (add-to-list 'load-path "~/.emacs.d/plugins")
  (add-to-list 'load-path "~/.emacs.d/plugins/evil-org-mode")
  (add-to-list 'load-path "/usr/local/Cellar/mu/HEAD/bin/mu")
  (add-to-list 'exec-path "/usr/local/bin")
  (add-to-list 'load-path "/Users/Andy/Documents/Programming_Projects/dracula-theme/emacs")
#+END_SRC

=use-package= is a =require= replacement that helps Emacs load faster. Might be a placebo.

#+BEGIN_SRC emacs-lisp
  (require 'use-package)
#+END_SRC

* Essential Settings

These are basic Emacs settings. They include inhibiting the startup screen and menu-bar and various small visual preferences.

#+BEGIN_SRC emacs-lisp
  (setq inhibit-splash-screen t
        inhibit-startup-message t
        inhibit-startup-echo-area-message t) (menu-bar-mode -1)
  (tool-bar-mode -1)
  (when (boundp 'scroll-bar-mode)
    (scroll-bar-mode -1))
  (show-paren-mode nil)
  (setq visual-line-fringe-indicators '(left-curly-arrow right-curly-arrow))
  (setq-default left-fringe-width nil)
  (setq-default indent-tabs-mode nil)
  (eval-after-load "vc" '(setq vc-handled-backends nil))
  (setq vc-follow-symlinks t)
  (setq large-file-warning-threshold nil)
  (setq split-width-threshold nil)
  (setq custom-safe-themes t)
  (put 'narrow-to-region 'disabled nil)
  (setq global-visual-line-mode t)
  (setq word-wrap t)
  (setq initial-major-mode 'org-mode)
  (setq initial-scratch-message "")
  (setq-default fill-column 80)
  (setq-default tab-width 2)
  (put 'dired-find-alternate-file 'disabled nil)

#+END_SRC

I prefer for Emacs to store automatic backups in a central location, rather than leaving them strewn about.

#+BEGIN_SRC emacs-lisp
  (setq backup-directory-alist '(("." . "~/Dropbox/emacs_backups"))
        backup-by-copying      t  ; Don't de-link hard links
        version-control        t  ; Use version numbers on backups
        delete-old-versions    t  ; Automatically delete excess backups:
        kept-new-versions      5 ; how many of the newest versions to keep
        kept-old-versions      5) ; and how many of the old

#+END_SRC

