old.emacs.d/config.tex
% Created 2016-08-03 Wed 14:19
\documentclass{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Andy Pierz}
\date{\today}
\title{config.org}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.5.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle

\section{Emacs Configuration}
\label{sec-1}

This is my personal Emacs configuration. I use the \href{https://github.com/railwaycat/homebrew-emacsmacport}{Railwaycat Emacs for Mac} port. It has two main advantages over the Emacs for Mac OSX port for me: 1. it renders colors in my Powerline better, and 2. It lets me use 2 finger swiping to navigate through buffers, which is very handy when I am looking at Emacs while working on something else.

\subsubsection{Screenshot of my config}
\label{sec-1-0-1}
\url{https://github.com/apierz/dotfiles/blob/master/screenshot.png?raw=true} 

\section{Personal Information}
\label{sec-2}

\begin{verbatim}
(setq user-full-name "Andy Pierz"
      user-mail-address "andy@andypierz.com")
\end{verbatim}
\section{Packages and Paths}
\label{sec-3}

The first thing that gets loaded is \texttt{package}, Emacs' package manager. I then add some common repositories for Emacs packages and initialize package.

\begin{verbatim}
(require 'package)
(add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/"))
(add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/"))
(add-to-list 'package-archives '("melpa-stable" .
"http://stable.melpa.org/packages/"))

(setq package-enable-at-startup nil)
(package-initialize)
\end{verbatim}

Next I want to set my load paths, it's mostly the standard folders, plus one for my working Dracula Theme Directory.

\begin{verbatim}
(add-to-list 'load-path (expand-file-name "snippets" user-emacs-directory))
(add-to-list 'load-path "~/.emacs.d/plugins")
(add-to-list 'load-path "~/.emacs.d/plugins/evil-org-mode")
(add-to-list 'load-path "/usr/local/Cellar/mu/HEAD/bin/mu")
(add-to-list 'exec-path "/usr/local/bin")
(add-to-list 'load-path "/Users/Andy/Documents/Programming_Projects/dracula-theme/emacs")
\end{verbatim}

\texttt{use-package} is a \texttt{require} replacement that helps Emacs load faster. Might be a placebo.

\begin{verbatim}
(require 'use-package)
\end{verbatim}

\section{Essential Settings}
\label{sec-4}

\subsection{Simple Configuration Settings}
\label{sec-4-1}

These are basic Emacs settings. They include inhibiting the startup screen and menu-bar and various small visual preferences.

\begin{verbatim}
(setq inhibit-splash-screen t
      inhibit-startup-message t
      inhibit-startup-echo-area-message t) (menu-bar-mode -1)
(tool-bar-mode -1)
(when (boundp 'scroll-bar-mode)
  (scroll-bar-mode -1))
(show-paren-mode nil)
(setq visual-line-fringe-indicators '(left-curly-arrow right-curly-arrow))
(setq-default left-fringe-width nil)
(setq-default indent-tabs-mode nil)
(eval-after-load "vc" '(setq vc-handled-backends nil))
(setq vc-follow-symlinks t)
(setq large-file-warning-threshold nil)
(setq split-width-threshold nil)
(setq custom-safe-themes t)
(put 'narrow-to-region 'disabled nil)
(setq global-visual-line-mode t)
(setq word-wrap t)
(setq initial-major-mode 'org-mode)
(setq initial-scratch-message "")
(setq-default fill-column 80)
(setq-default tab-width 2)
(put 'dired-find-alternate-file 'disabled nil)
\end{verbatim}

\subsection{Title Bar Configuration}
\label{sec-4-2}

Emacs@hostname is not very useful information for the title bar.

\begin{verbatim}
(setq frame-title-format
  '("" invocation-name ": "(:eval (if (buffer-file-name)
                (abbreviate-file-name (buffer-file-name))
                  "%b"))))
\end{verbatim}


\subsection{Backup Configuration}
\label{sec-4-3}

I prefer for Emacs to store automatic backups in a central location, rather than leaving them strewn about.

\begin{verbatim}
(setq backup-directory-alist '(("." . "~/Dropbox/emacs_backups"))
      backup-by-copying      t  ; Don't de-link hard links
      version-control        t  ; Use version numbers on backups
      delete-old-versions    t  ; Automatically delete excess backups:
      kept-new-versions      5 ; how many of the newest versions to keep
      kept-old-versions      5) ; and how many of the old
\end{verbatim}
