emacs.d/config.org
* Utility Functions

Small utility functions, mostly collected from others.

From [[https://github.com/aaronbieber][aaronbieber]]

#+BEGIN_SRC emacs-lisp
  (defun cycle-powerline-separators (&optional reverse)
    "Set Powerline separators in turn.  If REVERSE is not nil, go backwards."
   (interactive)
   (let* ((fn (if reverse 'reverse 'identity))
     (separators (funcall fn '("arrow" "arrow-fade" "slant"
                               "chamfer" "wave" "brace" "roundstub" "zigzag"
                               "butt" "rounded" "contour" "curve")))
     (found nil))
    (while (not found)
      (progn (setq separators (append (cdr separators) (list (car separators))))
      (when (string= (car separators) powerline-default-separator)
        (progn (setq powerline-default-separator (cadr separators))
           (setq found t)
            (redraw-display)))))))


  (defun rename-this-file-and-buffer (new-name)
    "Renames both current buffer and file it's visiting to NEW-NAME."
    (interactive "sNew name: ")
    (let ((name (buffer-name))
          (filename (buffer-file-name)))
      (unless filename
        (error "Buffer '%s' is not visiting a file!" name))
      (if (get-buffer new-name)
          (message "A buffer named '%s' already exists!" new-name)
        (progn
          (when (file-exists-p filename)
           (rename-file filename new-name 1))
          (rename-buffer new-name)
  (set-visited-file-name new-name)))))

  (defun delete-this-file ()
    "Delete the current file, and kill the buffer."
    (interactive)
    (or (buffer-file-name) (error "No file is currently being edited"))
    (when (yes-or-no-p (format "Really delete '%s'?"
                               (file-name-nondirectory buffer-file-name)))
      (delete-file (buffer-file-name))
  (kill-this-buffer)))


  (require 'htmlfontify)
  (defun fontify-and-browse ()
    "Fontify the current buffer into HTML, write it to a temp file, and open it in a browser."
    (interactive)
    (let* ((fontified-buffer (hfy-fontify-buffer))
           (temp-file-name (make-temp-file "ff" nil ".html")))
      (with-current-buffer fontified-buffer
        (write-region (point-min) (point-max) temp-file-name))
      (browse-url (concat "file://" temp-file-name))))


  (defun show-first-occurrence ()
    "Display the location of the word at point's first occurrence in the buffer."
    (interactive)
    (save-excursion
      (let ((search-word (thing-at-point 'symbol t)))
        (goto-char 1)
        (re-search-forward search-word)
        (message (concat
                  "L" (number-to-string (line-number-at-pos)) ": "
                  (replace-regexp-in-string
                   "[ \t\n]*\\'"
                   ""
                   (thing-at-point 'line t)
                   ))))))

  (defun switch-to-previous-buffer ()
    "Switch to previously open buffer.
  Repeated invocations toggle between the two most recently open buffers."
    (interactive)
    (switch-to-buffer (other-buffer (current-buffer) 1)))

  (defun narrow-and-set-normal ()
    "Narrow to the region and, if in a visual mode, set normal mode."
    (interactive)
    (narrow-to-region (region-beginning) (region-end))
    (if (string= evil-state "visual")
        (progn (evil-normal-state nil)
  (evil-goto-first-line))))

#+END_SRC

From [[http://www.github.com/hrs][hrs]]

#+BEGIN_SRC emacs-lisp
  (defmacro diminish-minor-mode (filename mode &optional abbrev)
    "Supply a FILENAME, to hide a minor MODE or replace with an ABBREV."
    `(eval-after-load (symbol-name ,filename)
       '(diminish ,mode ,abbrev)))

  (defmacro diminish-major-mode (mode-hook abbrev)
    "Supply a MODE-HOOK, to hide a major MODE or replace with an ABBREV."
    `(add-hook ,mode-hook
               (lambda () (setq mode-name ,abbrev))))
#+END_SRC

Mine + Unknown

#+BEGIN_SRC emacs-lisp

    (defun search-my-notes (searchforthis)
      "Search for SEARCHFORTHIS."
      (interactive "sSearch Query: ")
      (rgrep searchforthis "*.txt"  "~/Dropbox/Notes"))

    (eval-after-load "grep"
      '(grep-compute-defaults))

    (defun minibuffer-keyboard-quit ()
      "Abort recursive edit.
    In Delete Selection mode, if the mark is active, just deactivate it;
    then it takes a second \\[keyboard-quit] to abort the minibuffer."
      (interactive)
      (if (and delete-selection-mode transient-mark-mode mark-active)
          (setq deactivate-mark  t)
        (when (get-buffer "*Completions*") (delete-windows-on "*Completions*"))
        (abort-recursive-edit)))

    (defun andy-new-empty-buffer ()
      "Open a new empty buffer."
      (interactive)
      (let ((ξbuf (generate-new-buffer "untitled")))
        (switch-to-buffer ξbuf)
        (funcall (and initial-major-mode))
        (setq buffer-offer-save t)))



#+END_SRC

* Visual Stuff

I use my own version of [[https://github.com/dracula/dracula-theme][Dracua Theme]], which includes some extra coloring for Helm, mu4e, some changes to the syntax highlighting and correcting the background color when using Emacs in the terminal. My version is availble at my [[https://github.com/apierz][Github page]]. I also use [[http://sourcefoundry.org/hack/][Hack]] as my font. Right now I'm trying out transparency to see how I like it.

#+BEGIN_SRC emacs-lisp
  (use-package dracula-theme)
  (load-theme 'dracula t)

  (load-theme 'dracula t)
  (set-face-attribute 'default nil
                       :family "Hack" :height 140)

  (set-frame-parameter (selected-frame) 'alpha '(90 90))
  (add-to-list 'default-frame-alist '(alpha 90 90))
#+END_SRC

Just to be double-dog sure it ends up as utf-8...

#+BEGIN_SRC emacs-lisp
  (prefer-coding-system       'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (setq buffer-file-coding-system 'utf-8)
#+END_SRC

I use some diminsh functions I got from [[https://github.com/hrs][hrs]]. This lets me hide some minor modes and rename others as encircled unicode characters. I also rename some major modes to save a little space in my powerline.

#+BEGIN_SRC emacs-lisp
  (diminish-minor-mode 'auto-complete 'auto-complete-mode " ⓐ ")
  (diminish-minor-mode 'flycheck 'flycheck-mode " ⓕ ")
  (diminish-minor-mode 'projectile 'projectile-mode " ⓟ ")
  (diminish-minor-mode 'robe 'robe-mode " ⓡ ")
  (diminish-minor-mode 'flymake 'flymake-mode " ⓜ ")
  (diminish-minor-mode 'evil-snipe 'evil-snipe-local-mode)
  (diminish-minor-mode 'evil-surround 'evil-surround-mode )
  (diminish-minor-mode 'evil-commentary 'evil-commentary-mode)
  (diminish-minor-mode 'yasnippet 'yas-minor-mode)
  (diminish-minor-mode 'autorevert 'auto-revert-mode)
  (diminish-minor-mode 'flyspell 'flyspell-mode)
  (diminish-minor-mode 'undo-tree 'undo-tree-mode)
  (diminish-minor-mode 'evil-org 'evil-org-mode)

  (diminish-major-mode 'emacs-lisp-mode-hook ".el")
  (diminish-major-mode 'haskell-mode-hook "?=")
  (diminish-major-mode 'lisp-interaction-mode-hook "?")
  (diminish-major-mode 'python-mode-hook ".py")
  (diminish-major-mode 'ruby-mode-hook ".rb")
  (diminish-major-mode 'sh-mode-hook ".sh")
  (diminish-major-mode 'markdown-mode-hook ".md")

#+END_SRC

* evil-mode

I prefer the Vim keybindings and use them wherever possible in Emacs. I recently made a switch to HJKL from IJKL when I learned the arrow keys on my =Pok3r= keyboard could be reprogrammed to use HJKL everywhere so I'm currently tring to unlearn my old bad habits.

** Main package:

#+BEGIN_SRC emacs-lisp
  (use-package evil)
  (evil-mode t)
#+END_SRC

