emacs.d/config.org
** Addons, based on Vim plugins

=evil-surround= is based on tpope's plugin and makes it easy to change surrounding syntax luke ", ', (, {, etc. =evil-commentary= is also based on a tpope plugin that makes it easy to comment a line or lines. [g-c-c] will comment a line [g-c-4-k] will comment the next 4 lines, etc. 

#+BEGIN_SRC emacs-lisp
  (use-package evil-leader)
  (use-package evil-surround
    :config
    (global-evil-surround-mode 1))
  (use-package evil-commentary
    :config
    (evil-commentary-mode))
  (use-package evil-snipe
    :config
    (evil-snipe-mode 1)
    (evil-snipe-override-mode 1))

#+END_SRC

** Controls

   These give me IJKL controls the places that I want them. Also I use 'hh' as a quick shortcut to return to =evil-normal-state=.

#+BEGIN_SRC emacs-lisp
  (use-package key-chord
    :config
    (key-chord-mode 1))

  (key-chord-define evil-insert-state-map "hh" 'evil-normal-state)
  (key-chord-define evil-replace-state-map "hh" 'evil-normal-state)
  (key-chord-define evil-visual-state-map "hh" 'evil-normal-state)
  (key-chord-define evil-motion-state-map "hh" 'evil-normal-state)
  (evil-define-key 'normal dired-mode-map "l" 'dired-find-alternate-file)
  (evil-define-key 'normal dired-mode-map "v" 'dired-toggle-marks)
  (evil-define-key 'normal dired-mode-map "m" 'dired-mark)
  (evil-define-key 'normal dired-mode-map "u" 'dired-unmark)
  (evil-define-key 'normal dired-mode-map "U" 'dired-unmark-all-marks)
  (evil-define-key 'normal dired-mode-map "c" 'dired-create-directory)
  (evil-define-key 'normal dired-mode-map "n" 'evil-search-next)
  (evil-define-key 'normal dired-mode-map "N" 'evil-search-previous)
  (evil-define-key 'normal dired-mode-map "q" 'kill-this-buffer)
  (setq evil-shift-width 2)

#+END_SRC

   I made some changes to the normal =evil-org= keybindings because I think these bindings are more intuitive.

#+BEGIN_SRC emacs-lisp
  (use-package evil-org)
  (evil-define-key 'normal evil-org-mode-map (kbd "M-k") 'org-metaup)
  (evil-define-key 'normal evil-org-mode-map (kbd "M-h") 'org-metaleft)
  (evil-define-key 'normal evil-org-mode-map (kbd "M-j") 'org-metadown)
  (evil-define-key 'normal evil-org-mode-map (kbd "M-l") 'org-metaright)
  (evil-define-key 'normal evil-org-mode-map (kbd "M-K") 'org-shiftmetaup)
  (evil-define-key 'normal evil-org-mode-map (kbd "M-H") 'org-shiftmetaleft)
  (evil-define-key 'normal evil-org-mode-map (kbd "M-J") 'org-shiftmetadown)
  (evil-define-key 'normal evil-org-mode-map (kbd "M-L") 'org-shiftmetaright)
  (evil-define-key 'normal evil-org-mode-map (kbd "K") 'org-shiftup)
  (evil-define-key 'normal evil-org-mode-map (kbd "H") 'org-shiftleft)
  (evil-define-key 'normal evil-org-mode-map (kbd "J") 'org-shiftdown)
  (evil-define-key 'normal evil-org-mode-map (kbd "L") 'org-shiftright)
#+END_SRC

** Evil Leader

   =Evil Leader= is a package that let's you do quick shortcuts in =evil-mode=. While in =evil-normal-state= you press and hold your leader key ( for me its ,) and then press another key to trigger a function. It's very handy and great for triggering little utility functions you come accross.

#+BEGIN_SRC emacs-lisp
  (defun andy--config-evil-leader ()
    "Configure evil leader mode."
    (evil-leader/set-leader ",")
    (setq evil-leader/in-all-states 1)
    (evil-leader/set-key
      "k"  'switch-to-previous-buffer
      "m"  'previous-buffer
      "."  'next-buffer
      ":"  'eval-expression
      "b"  'helm-mini
      "d"  'kill-this-buffer
      "e"  'find-file
      "f"  'fontify-and-browse
      "p"  'cycle-powerline-separators
      "b"  'switch-to-buffer
      "l"  'whitespace-mode       ;; Show invisible characters
      "nn" 'narrow-and-set-normal ;; Narrow to region and enter normal mode
      "nw" 'widen
      "o"  'delete-other-windows  ;; C-w o
      "S"  'delete-trailing-whitespace
      "t"  'gtags-reindex
      "T"  'gtags-find-tag
      "w"  'save-buffer
      "x"  'helm-M-x))

  (global-evil-leader-mode)
  (andy--config-evil-leader)

#+END_SRC

** macOS Specific Stuff

   Use the standard OSX keys for cut/copy/paste.

#+BEGIN_SRC emacs-lisp
  (defun pbcopy ()
    "Use OSX' pasteboard for copying."
    (interactive)
    (call-process-region (point) (mark) "pbcopy")
    (setq deactivate-mark t))

  (defun pbpaste ()
    "Use OSX' pasteboard for pasting."
    (interactive)
    (call-process-region (point) (if mark-active (mark) (point)) "pbpaste" t t))

  (defun pbcut ()
    "Use OSX' pasteboard for cutting."
    (interactive)
    (pbcopy)
    (delete-region (region-beginning) (region-end)))

  (global-set-key (kbd "M-c") 'pbcopy)
  (global-set-key (kbd "C-c x") 'pbcut)
  (global-set-key (kbd "M-v") 'pbpaste)


#+END_SRC

   Switch the macOS =Command= button to be Emacs =Meta= key.

#+BEGIN_SRC emacs-lisp

  (defun mac-switch-meta nil
    "Switch meta between Option and Command."
    (interactive)
    (if (eq mac-option-modifier nil)
        (progn
    (setq mac-option-modifier 'meta)
    (setq mac-command-modifier 'hyper)
  )
      (progn
        (setq mac-option-modifier nil)
        (setq mac-command-modifier 'meta))))

#+END_SRC


** Minor evil Configurations

   Stop that terrible cursor move back nonsense!

#+BEGIN_SRC emacs-lisp

(setq evil-move-cursor-back nil)

#+END_SRC

   Set some shortcuts to the function buttons.

#+BEGIN_SRC emacs-lisp
  (global-set-key [f1]  'mu4e)
  (global-set-key [f2] 'andy-new-empty-buffer)

  (global-set-key [f4] 'fci-mode)
  (global-set-key [f5] 'search-my-notes)
  (global-set-key [f6] 'linum-relative-mode)
#+END_SRC

   Robe Mode Commands

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "M-j") 'robe-jump)
#+END_SRC

   Magit Commands

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-x g") 'magit-status)
  (global-set-key (kbd "C-x M-g") 'magit-dispatch-popup)

#+END_SRC

   Use ESC to quit non-evil stuff

#+BEGIN_SRC emacs-lisp
  (define-key evil-normal-state-map [escape] 'keyboard-quit)
  (define-key evil-motion-state-map [escape] 'keyboard-quit)
  (define-key evil-visual-state-map [escape] 'keyboard-quit)
  (define-key evil-emacs-state-map [escape] 'keyboard-quit)
  (define-key minibuffer-local-map [escape] 'minibuffer-keyboard-quit)
  (define-key minibuffer-local-ns-map [escape] 'minibuffer-keyboard-quit)
  (define-key minibuffer-local-completion-map [escape] 'minibuffer-keyboard-quit)
  (define-key minibuffer-local-must-match-map [escape]'minibuffer-keyboard-quit)
  (define-key minibuffer-local-isearch-map [escape] 'minibuffer-keyboard-quit)
#+END_SRC

   Use =evil= controls in =Dired= and other =motion-state= modes.

#+BEGIN_SRC emacs-lisp
  (setq evil-normal-state-modes (append evil-motion-state-modes
    evil-normal-state-modes))
#+END_SRC

* Helm
Helm is useful for searching through Emacs. I prefer Helm for searching through my buffers, kill ring and other things.

#+BEGIN_SRC emacs-lisp
  (use-package helm)
  (use-package helm-config)
  (global-set-key (kbd "C-x b") 'helm-buffers-list)
  (global-set-key (kbd "C-x r b") 'helm-bookmarks)
  (global-set-key (kbd "C-X m") 'helm-M-x)
  (global-set-key (kbd "M-y") 'helm-show-kill-ring)
  (global-set-key (kbd "C-x C-f") 'helm-find-files)

  (setq helm-split-window-in-side-p t)

  (with-eval-after-load
    'helm (define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action)
       (define-key helm-map (kbd "ESC") 'helm-keyboard-quit)
  )
#+END_SRC

