emacs.d/config.org
** Ruby

#+BEGIN_SRC emacs-lisp
  (add-hook 'ruby-mode-hook
    (lambda ()
      (setq ruby-insert-encoding-magic-comment nil)
        (yas-minor-mode)
        (robe-mode)
        (rainbow-delimiters-mode)
        (local-set-key "\r" 'newline-and-indent)
        (flymake-mode)
        (flymake-ruby-load)
        (define-key ruby-mode-map (kbd "C-c C-c") 'xmp)
        (define-key ruby-mode-map (kbd "C-c C-s") 'inf-ruby)
        (define-key ruby-mode-map (kbd "C-c C-r") 'ruby-send-region)
        (define-key ruby-mode-map (kbd "C-c C-z") 'ruby-switch-to-inf)
        (define-key ruby-mode-map (kbd "C-c C-l") 'ruby-load-file)
        (define-key ruby-mode-map (kbd "C-c C-b") 'ruby-send-block)
  ))
  (add-to-list 'auto-mode-alist
    '("\\.\\(?:erb\\)\\'" . web-mode))

  (add-to-list 'auto-mode-alist
    '("\\.\\(?:cap\\|gemspec\\|irbrc\\|gemrc\\|rake\\|rb\\|ru\\|thor\\)\\'" . ruby-mode))
  (add-to-list 'auto-mode-alist
    '("\\(?:Brewfile\\|Capfile\\|Gemfile\\(?:\\.[a-zA-Z0-9._-]+\\)?\\|[rR]akefile\\)\\'" . ruby-mode))

#+END_SRC

** web-mode

=Web-mode= is an Emacs major mode that gives syntax highlighting for web source files with multiple languages like html with php or .erb files.

#+BEGIN_SRC emacs-lisp
  (use-package web-mode
    :ensure t
    :defer t
    :config
    (add-to-list 'auto-mode-alist '("\\.html$" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.erb$" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.twig$" . web-mode))
    (setq web-mode-attr-indent-offset 2)
    (setq web-mode-code-indent-offset 2)
    (setq web-mode-css-indent-offset 2)
    (setq web-mode-indent-style 2)
    (setq web-mode-markup-indent-offset 2)
    (setq web-mode-sql-indent-offset 2))
#+END_SRC

