emacs.d/config.org
* Projectile

=projectile= is a helpful way to search through files in a project.

#+BEGIN_SRC emacs-lisp
  (use-package projectile)
  (use-package helm-projectile)
#+END_SRC

I use a few basic settings and have =projectile= auto load whenever I'm in =ruby-mode=.

#+BEGIN_SRC emacs-lisp
  (add-hook 'ruby-mode-hook 'projectile-mode)
  (setq projectile-indexing-method 'alien)
  (setq projectile-switch-project-action 'projectile-find-file)
  (setq projectile-completion-system 'default)
  (setq projectile-enable-caching nil)

  (helm-projectile-on)

  (set-face-attribute 'helm-source-header nil :foreground "#ffb86c" :height 1.66)
#+END_SRC 

* mu4e

=mu4e= is an email client that works within Emacs. I use =mu4e-multi= to manage my work and personal accounts and =evil-mu4e= for some keybinding changes.

#+BEGIN_SRC emacs-lisp
  (use-package mu4e)
  (require 'mu4e-multi)
  (use-package evil-mu4e)
#+END_SRC

General Configuragtion

#+BEGIN_SRC emacs-lisp
    (setq mu4e-mu-binary "/usr/local/Cellar/mu/HEAD/bin/mu")
    (setq mu4e-maildir "/Users/Andy/.Maildir")

    (setq mu4e-multi-account-alist
      '(("personal"
         (user-mail-address .  "andy@andypierz.com")
         (user-full-name  .   "Andy Pierz")
         (mu4e-sent-folder .  "/personal/Sent\ Items")
         (mu4e-drafts-folder . "/personal/Drafts")
         (mu4e-trash-folder .  "/personal/Trash")
         (mu4e-refile-folder . "/personal/Archive"))
        ("work"
         (user-mail-address .  "andy@mutdut.com")
         (user-fullname . "Andy Pierz")
         (mu4e-sent-folder .  "/work/Sent\ Items")
         (mu4e-drafts-folder . "/work/Drafts")
         (mu4e-trash-folder .  "/work/Trash")
         (mu4e-refile-folder . "/work/Archive"))))

    (mu4e-multi-enable)

    (setq mu4e-drafts-folder "/drafts")


    ;;set attachment downloads directory
    (setq mu4e-attachment-dir  "~/Downloads")

    ;; setup some handy shortcuts
    ;; you can quickly switch to your Inbox -- press ``ji''
    ;; then, when you want archive some messages, move them to
    ;; the 'All Mail' folder by pressing ``ma''.

    (setq mu4e-maildir-shortcuts
      '( ("/personal/INBOX"              . ?i)
         ("/personal/Sent\ Items"   . ?s)
         ("/personal/Trash"       . ?t)
         ("/personal/Archive"    . ?a)
         ("/personal/Starred"    . ?p)
         ("/personal/Drafts"    . ?d)
           
         ("/work/INBOX"      . ?w)
         ("/work/Drafts"      . ?z)
         ("/work/Sent\ Items"       . ?f)
         ("/work/Archive"    . ?o)))


    ;; allow for updating mail using 'U' in the main view:
    (setq mu4e-get-mail-command "offlineimap")
    (setq mu4e-update-interval 300)

    ;; something about ourselves
    (setq
      user-mail-address "andy@andypierz.com"
      user-full-name  "Andy Pierz"
      mu4e-compose-signature
      (concat
        ""
        ""))


    (require 'smtpmail)

    (setq message-send-mail-function 'smtpmail-send-it
      smtpmail-stream-type 'ssl
      smtpmail-default-smtp-server "mail.hover.com"
      smtpmail-smtp-server "mail.hover.com"
      smtpmail-smtp-service 465)

    ;; don't keep message buffers around
    (setq message-kill-buffer-on-exit t)

    (defvar my-mu4e-account-alist
      '(("personal"
      ;; about me
      (user-mail-address      "andy@andypierz.com")
      (user-full-name         "Andy Pierz")
      ;; smtp
      (smtpmail-stream-type ssl)
      (smtpmail-starttls-credentials '(("mail.hover.com" 587 nil nil)))
      (smtpmail-default-smtp-server "mail.hover.com")
      (smtpmail-smtp-server "mail.hover.com")
      (smtpmail-smtp-service 465))
      ("work"
      ;; about me
      (user-mail-address      "andy@mutdut.com")
      (user-full-name         "Andy Pierz")
      ;;(mu4e-compose-signature "0xAX")

      ;; smtp
      (smtpmail-stream-type ssl)
      (smtpmail-auth-credentials '(("mail.hover.com" 25 "andy@mutdut.com" nil)))
      (smtpmail-default-smtp-server "mail.hover.com")
      (smtpmail-smtp-service 465))))

    (defun my-mu4e-set-account ()
      "Set the account for composing a message."
      (let* ((account
        (if mu4e-compose-parent-message
          (let ((maildir (mu4e-message-field mu4e-compose-parent-message :maildir)))
          (string-match "/\\(.*?\\)/" maildir)
          (match-string 1 maildir))
          (completing-read (format "Compose with account: (%s) "
            (mapconcat #'(lambda (var) (car var)) my-mu4e-account-alist "/"))
            (mapcar #'(lambda (var) (car var)) my-mu4e-account-alist)
              nil t nil nil (car my-mu4e-account-alist))))
            (account-vars (cdr (assoc account my-mu4e-account-alist))))
        (if account-vars
          (mapc #'(lambda (var)
           (set (car var) (cadr var)))
              account-vars)
        (error "No email account found"))))

    (add-hook 'mu4e-compose-pre-hook 'my-mu4e-set-account)


    (use-package evil-mu4e)

    (define-key mu4e-headers-mode-map "p" 'mu4e-headers-mark-for-flag)

    (add-hook 'mu4e-main-mode-hook 'evil-motion-state)
    (add-hook 'mu4e-headers-mode-hook 'evil-motion-state)
#+END_SRC


Use Dired to add attachments to emails.

#+BEGIN_SRC emacs-lisp
    (require 'gnus-dired)
    ;; make the `gnus-dired-mail-buffers' function also work on
    ;; message-mode derived modes, such as mu4e-compose-mode
    (defun gnus-dired-mail-buffers ()
      "Return a list of active message buffers."
      (let (buffers)
        (save-current-buffer
          (dolist (buffer (buffer-list t))
      (set-buffer buffer)
      (when (and (derived-mode-p 'message-mode)
        (null message-sent-message-via))
        (push (buffer-name buffer) buffers))))
        (nreverse buffers)))

    (setq gnus-dired-mail-mode 'mu4e-user-agent)
    (add-hook 'dired-mode-hook 'turn-on-gnus-dired-mode)
#+END_SRC

Show some images in email messages.

#+BEGIN_SRC emacs-lisp

    (setq mu4e-view-show-images t)
    (setq mu4e-view-show-image-max-width 800)
    (when (fboundp 'imagemagick-register-types)
      (imagemagick-register-types))
    (setq mu4e-view-prefer-html nil)

#+END_SRC


Convert html emails to text.

#+BEGIN_SRC emacs-lisp
  (setq mu4e-html2text-command 'mu4e-shr2text)
#+END_SRC
* Magit

Magit is Emacs' Git interface.

#+BEGIN_SRC emacs-lisp
  (use-package magit)
  (use-package evil-magit)


#+END_SRC

This is to encrypt my password so I can use it when sending email. If anyone knows how to set this up so it doesn't trigger an error everytime I re eval my buffer please let me know:

#+BEGIN_SRC emacs-lisp
  (use-package epa-file
    :config
    (unless (memq epa-file-handler file-name-handler-alist)
    (epa-file-enable)))
#+END_SRC
